In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [6]:
data = pd.read_csv('titanic.csv')

In [7]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
data.drop(columns=['PassengerId','Pclass','Name','Parch','Ticket','Fare','Cabin','Embarked','SibSp'],inplace=True)

In [11]:
data

     Survived     Sex   Age
0           0    male  22.0
1           1  female  38.0
2           1  female  26.0
3           1  female  35.0
4           0    male  35.0
..        ...     ...   ...
886         0    male  27.0
887         1  female  19.0
888         0  female   NaN
889         1    male  26.0
890         0    male  32.0

[891 rows x 3 columns]

In [15]:
data['Sex'] = pd.get_dummies(data['Sex'], drop_first=True)

In [16]:
data.head()

   Survived  Sex   Age
0         0    1  22.0
1         1    0  38.0
2         1    0  26.0
3         1    0  35.0
4         0    1  35.0

In [17]:
data['Age'].mean()

29.69911764705882

In [19]:
data['Age'].fillna(data['Age'].mean())

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [20]:
data.head()

   Survived  Sex   Age
0         0    1  22.0
1         1    0  38.0
2         1    0  26.0
3         1    0  35.0
4         0    1  35.0

In [22]:
data[data['Survived'] == 1]

     Survived  Sex   Age
1           1    0  38.0
2           1    0  26.0
3           1    0  35.0
8           1    0  27.0
9           1    0  14.0
..        ...  ...   ...
875         1    0  15.0
879         1    0  56.0
880         1    0  25.0
887         1    0  19.0
889         1    1  26.0

[342 rows x 3 columns]

In [25]:
plt.scatter()

TypeError: scatter() missing 1 required positional argument: 'y'